import { IHistoryDates } from '@/shared/types';

export const mockHistoryDates: IHistoryDates = {
	title: 'Исторические даты',
	dates: [
		{
			id: 1,
			label: 'Технологии',
			startYear: 1980,
			endYear: 1986,
			events: [
				{
					id: 1,
					year: 1980,
					content: 'Sinclair Research выпускает домашний компьютер ZX80',
				},
				{
					id: 2,
					year: 1981,
					content:
						'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
				},
				{
					id: 3,
					year: 1982,
					content:
						'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
				},
				{
					id: 4,
					year: 1983,
					content:
						'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
				},
				{
					id: 5,
					year: 1984,
					content:
						'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
				},
				{
					id: 6,
					year: 1985,
					content:
						'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
				},
			],
		},
		{
			id: 2,
			label: 'Кино',
			startYear: 1987,
			endYear: 1991,
			events: [
				{
					id: 1,
					year: 1987,
					content: '«Хищник»/Predator, США (реж. Джон Мактирнан)',
				},
				{
					id: 2,
					year: 1988,
					content:
						'«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис)',
				},
				{
					id: 3,
					year: 1989,
					content:
						'«Назад в будущее 2»/Back То The Future 2, США (реж. Роберт Земекис)',
				},
				{
					id: 4,
					year: 1990,
					content: '«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)',
				},
				{
					id: 5,
					year: 1991,
					content:
						'«Семейка Аддамс»/The Addams Family, США, (реж. Барри Зонненфельд)',
				},
			],
		},
		{
			id: 3,
			label: 'Литература',
			startYear: 1992,
			endYear: 1997,
			events: [
				{
					id: 1,
					year: 1992,
					content:
						'Нобелевская премия по литературе – Дерек Уолкотт, "За блестящий образец карибского эпоса в 64 разделах"',
				},
				{
					id: 2,
					year: 1994,
					content: '«Бессонница» - роман Стивена Кинга.',
				},
				{
					id: 3,
					year: 1995,
					content: 'Нобелевская премия по литературе — Шеймас Хини',
				},
			],
		},
		{
			id: 4,
			label: '',
			startYear: 1999,
			endYear: 2004,
			events: [
				{
					id: 1,
					year: 1999,
					content:
						'премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона',
				},
				{
					id: 2,
					year: 2000,
					content: 'возобновлено издание журнала «Театр».',
				},
				{
					id: 3,
					year: 2002,
					content:
						'премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон',
				},
			],
		},
		{
			id: 5,
			label: 'Исследования',
			startYear: 2008,
			endYear: 2014,
			events: [
				{
					id: 1,
					year: 2008,
					content:
						'премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон',
				},
				{
					id: 2,
					year: 2010,
					content:
						'премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон',
				},
				{
					id: 3,
					year: 2012,
					content:
						'премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон',
				},
			],
		},
		{
			id: 6,
			label: 'Наука',
			startYear: 2015,
			endYear: 2022,
			events: [
				{
					id: 1,
					year: 2015,
					content:
						'13 сентября - частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
				},
				{
					id: 2,
					year: 2016,
					content:
						'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
				},
				{
					id: 3,
					year: 2017,
					content:
						'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
				},
				{
					id: 4,
					year: 2018,
					content:
						'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца',
				},
				{
					id: 5,
					year: 2019,
					content:
						'Google объявил о создании 53-кубитного квантового компьютера.',
				},
				{
					id: 6,
					year: 2020,
					content:
						'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта',
				},
			],
		},
	],
};
